In [12]:
import pandas as p
from pandas import DataFrame, Series

In [22]:
df1 = p.read_csv('data1.csv', index_col = 0)

In [19]:
df2 = p.read_csv('data2.csv', index_col = 1)

In [23]:
print(df1)
print(df2)

   A    B  C
0  1  2.0  3
1  4  5.0  6
4  2  NaN  5
       A  B  C
2      2  5  6
3  Hello  3  4

In [26]:
df3 = p.concat([df1, df2], axis = 0)
print(df3)

       A    B  C
0      1  2.0  3
1      4  5.0  6
4      2  NaN  5
2      2  5.0  6
3  Hello  3.0  4

In [31]:
df4 = p.read_csv('data3.csv', index_col=0)
print(df4)

   D  E
1  1  7
4  0  8

In [49]:
df5 = p.concat([df3, df4], axis = 1)
print(df5)

       A    B  C    D    E
0      1  2.0  3  NaN  NaN
1      4  5.0  6  1.0  7.0
2      2  5.0  6  NaN  NaN
3  Hello  3.0  4  NaN  NaN
4      2  NaN  5  0.0  8.0

In [61]:
df6 = p.read_json('data.json')
df7 = p.concat([df5, df6], axis = 0, ignore_index = "True")
df7

       A    B    C    D    E
0      1  2.0  3.0  NaN  NaN
1      4  5.0  6.0  1.0  7.0
2      2  5.0  6.0  NaN  NaN
3  Hello  3.0  4.0  NaN  NaN
4      2  NaN  5.0  0.0  8.0
5     11  9.0  NaN  NaN  NaN
6     22  7.0  NaN  NaN  NaN
7     33  8.0  NaN  NaN  NaN

In [70]:
df7.replace({"" : "NaN"}, inplace=True)
df7

     A    B    C    D    E
0    1  2.0  3.0  NaN  NaN
1    4  5.0  6.0  1.0  7.0
2    2  5.0  6.0  NaN  NaN
3  NaN  3.0  4.0  NaN  NaN
4    2  NaN  5.0  0.0  8.0
5   11  9.0  NaN  NaN  NaN
6   22  7.0  NaN  NaN  NaN
7   33  8.0  NaN  NaN  NaN

In [ ]:
df7.replace()